OpenFOAM/OpenFOAM-2.2.x/tutorials/incompressible/pimpleDyMFoam/mixerVesselAMI2D/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// MRF source to enable comparison between AMI and MRF case
// Note: inactive by default
MRF1
{
    type            MRFSource;
    active          no;
    selectionMode   cellZone;
    cellZone        rotor;

    MRFSourceCoeffs
    {
        // Fixed patches (by default they 'move' with the MRF zone)
        nonRotatingPatches ();

        origin    (0 0 0);
        axis      (0 0 1);
        omega     constant 104.72;
    }
}


// ************************************************************************* //
